app/controllers/movies_controller.rb

  def index
    sort_by = params[:sort_by] || 'title'
    sort_order = %w[asc desc].include?(params[:sort_order]) ? params[:sort_order] : 'asc'
    @movies = Movie.order("#{sort_by} #{sort_order}")
---
SELECT "movies".* FROM "movies" ORDER BY release_date desc

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Test Add"], ["rating", "G"], ["description", ""], ["release_date", "2024-07-03"], ["created_at", "2024-07-03 17:00:13.855228"], ["updated_at", "2024-07-03 17:00:13.855228"]]

  def update
    if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", ""], ["description", ""], ["updated_at", "2024-07-03 17:06:09.207540"], ["id", 6]]